{
  "1.0.0": {
    "en": "Support for Hoiax devices"
  },
  "1.0.1": {
    "en": "Removed the tank volume in the name of the water heater as a heater with greater capacity is going to be released later"
  },
  "1.1.0": {
    "en": "Fixed compliancy issues and simplified the maximum power control"
  },
  "1.1.1": {
    "en": "Compliancy fixes"
  },
  "1.1.2": {
    "en": "Added norwegian text to max power selector"
  },
  "1.2.0": {
    "en": "Added support to set some internal variables for the heater (ambient_temperature, inlet_temperature, legionella_frequency, max_water_flow and regulation_diff + added Nor"
  },
  "1.2.1": {
    "en": "Fixed hint for legionella program frequency"
  },
  "1.2.2": {
    "en": "Made code more reliable + added debug to understand further crashes"
  },
  "1.2.3": {
    "en": "Improved handling of invalid username/password"
  },
  "1.2.4": {
    "en": "Changed from crashing with log to updating the unavailable state. This makes the problem clearer to the user."
  },
  "1.2.5": {
    "en": "Added missing unit for norwegian translation of legionella program"
  },
  "1.3.0": {
    "en": "Added error handling in case of bad internet connection + added passive readouts of some device settings"
  },
  "1.3.1": {
    "en": "Added cleanup function to remove ghost intervals that kept running after the device had been deleted"
  },
  "1.3.2": {
    "en": "Fixed some crashes when fetching device values during bad internet connections"
  },
  "1.3.3": {
    "en": "Updated some dependencies"
  },
  "1.4.0": {
    "en": "Added new capability for reporting leakage heat + minor stability improvement"
  },
  "1.4.1": {
    "en": "Added capability to set ambient temperature + Fixed Energy leakage calculation."
  },
  "1.4.2": {
    "en": "Added capability to read amount of wasted energy due to leakage + added action card to set ambient temperature for improved accuracy."
  },
  "1.4.3": {
    "en": "Fixed some norwegian translations"
  },
  "1.4.4": {
    "en": "Removed calculation of leakage constant and set it to a low value, will replace with a more accurate measured value when possible."
  },
  "1.4.5": {
    "en": "Leakage heat has been measured over 3 days to give an accurate representation"
  },
  "1.4.6": {
    "en": "Fixed bug displaying current leakage energy"
  },
  "1.4.7": {
    "en": "Improved the description of heat loss to make it clear that the active component is not measured (yet)"
  },
  "1.5.0": {
    "en": "Added support for the built in spotpris controller in myUplink"
  },
  "1.5.1": {
    "en": "Made sure the controlling device is not reset to 'Homey' for every new update of the app in case someone changed it to Spot price"
  },
  "1.6.0": {
    "en": "Support for Connected 300 has been added + Fixed small bug that caused the app to crash if a device was deleted"
  },
  "1.6.1": {
    "en": "Added description that the leakage constant could be wrong for Connected 300 devices."
  },
  "1.6.2": {
    "en": "Fixed a bug interpreting the time for last leakage calculation after reboot"
  },
  "1.6.3": {
    "en": "Sneaky ad for my other app"
  },
  "1.6.4": {
    "en": "No functional change"
  },
  "1.6.5": {
    "en": "Moved notification from device to app"
  },
  "1.6.6": {
    "en": "Added a check if sparegris is installed so the notification don't appear if it is."
  },
  "1.6.7": {
    "en": "Fixed a crash bug as reported by EddieX in the forum + improved the lifetime of Homey by reducing wear introduced by writing to the disk (this will reduce the accuracy of the leakage heat calculation whenever the app is restarted but this is considered less important)."
  },
  "1.6.8": {
    "en": "Added some more debug information to try to resolve recent connection issues + Try to ignore Nordpool device setting if it cannot be retreived as this has been reported as an issue? (not sure why, it works on my device)"
  },
  "1.7.0": {
    "en": "Removed the deprecated myUplink feature to control the tank using NordPool prices."
  },
  "1.7.1": {
    "en": "Added back the spotprice option but this time with a check to prevent tanks without the options from crashing."
  },
  "1.7.2": {
    "en": "Fixed the code that sets the controlling device to Homey when the app is first installed. Unintentionally it was being reset on every app restart."
  },
  "1.7.3": {
    "en": "Added a better description when reading undefined values from myUplink"
  },
  "1.7.4": {
    "en": "Added debug output for latest crash report"
  },
  "1.7.5": {
    "en": "myUplink has started to only return partial responses at times... probably due to high load. Instead of crashing the app will now just ignore the partial response and you will have to wait for another 5 minutes before you get the data."
  },
  "1.7.6": {
    "en": "Added a check to make sure device communication errors at device initialization time does not affect the device availability"
  },
  "1.7.7": {
    "en": "Made sure to keep the device in unavalable mode when myUplink is being troublesome"
  },
  "1.7.8": {
    "en": "Added guard against the new myUplink empty responses"
  },
  "1.7.9": {
    "en": "Fixed problem as reported by rovand on github  (device unavailable after install)"
  },
  "1.7.10": {
    "en": "Added firmware version to advanced settings readout"
  },
  "1.7.11": {
    "en": "Fixed accumulated leakage heat capability as reported by THN in the forum. + Added maintainance action to reset the accumulated leakage heat."
  },
  "1.7.12": {
    "en": "Attempted to fix a crash bug for zombie devices that was not shut down properly."
  },
  "1.7.13": {
    "en": "Fix for the missing authorization token (I think)"
  },
  "1.7.14": {
    "en": "Added some rate limitation to reduce ammount of throttling on the myUplink server."
  },
  "1.7.15": {
    "en": "Significant improvement in how often myUplink is signalled in case of error situations. Should remove issues for tanks stuck in endless unchanging states."
  },
  "1.7.16": {
    "en": "The previous bugfix did not catch the errors from the myuplink Api properly"
  }
}
